package lesson12;

public class Practice {
    public static void main(String[] args) {
        /*1. Написать метод который сможет вернуть все цифры из строки:
 “Today my 17th lesson. I’m the best 1! Find me in inst: @teachmeskills”.
        2. Написать метод который сможет заменить КАЖДУЮ букву на знак & в строке из 1
        задания.
        3. Написать метод который сможет вернуть инсту в строке из 1 задания.
        4. Написать метод который возвращает true если строка имеет вид “null”.
        5. В строке “Hello \n world \n !!!” заменить \n на “” используя классы Pattern и Matcher.
        6. В строке “Всем привет!! Меня зовут Билл Гейтс и я мечтаю учиться в TeachMeSkills!”
        найти имя и фамилию человека и вывести на экран!*/


    }
}
